app/controllers/animals_controller.rb

INSERT INTO "animals" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "frog"], ["description", "green, jumper."], ["created_at", "2015-07-20 15:34:48.117131"], ["updated_at", "2015-07-20 15:34:48.117131"]]
---
  def create
    @animal = Animal.new(animal_params)

    respond_to do |format|
      if @animal.save

UPDATE "animals" SET "description" = $1, "updated_at" = $2 WHERE "animals"."id" = $3  [["description", "green, jumper, should not cross the road."], ["updated_at", "2015-07-20 15:35:18.156494"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @animal.update(animal_params)

DELETE FROM "animals" WHERE "animals"."id" = $1  [["id", 2]]
---
  def destroy
    @animal.destroy

SELECT  "animals".* FROM "animals" WHERE "animals"."id" = $1 LIMIT 1  [["id", 2]]
---
    def set_animal
      @animal = Animal.find(params[:id])